# PythonBeginContext

## Description
This function creates a context in which PythonExecute scripts are run.<BR>
<BR>
This function consecutive python scripts to be executed inside the same python environment.

```pascal
PROCEDURE PythonBeginContext;
```

```python
def vs.PythonBeginContext():
    return None
```

## Examples
[[VS:PythonExecute]].

## See Also
VS Functions:
PythonExecute
| PythonEndContext

## Version
Availability: from Vectorworks 2014

## Category
* Utility